#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-keycloak_cust/runs/run-cePzn5HNgFR6XHvP

Waiting for the plan to start...

Terraform v0.15.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_openid_client.this: Refreshing state... [id=74f33d41-8079-4d5e-9e9f-0fb3f6109ad9]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ab3ae44b-725a-42f8-bcc2-98a4be33783d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=ee54c1c6-23c8-4be7-9463-25881f78dd53]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_openid_client.this: Refreshing state... [id=e5208611-d26a-47ee-a031-3e05cf726793]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3df466d9-10ea-4046-adc1-22e0fe9dba3f]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=4665917c-4624-4e76-8dda-15d05c596f0a]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_openid_client.this: Refreshing state... [id=bf8949c5-5a2b-4444-a71a-8b16df5ba634]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_openid_client.this: Refreshing state... [id=4b54d5af-2fa4-45fa-ad25-966184e0c812]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=26f2fc8f-0c8c-417a-ba8a-ff22a76c5ce9]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bdf21b43-a3b7-4194-900e-6236996b3567]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2cac2751-fab8-43b2-a039-3df4688c7855]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=889742ce-e722-4e9b-82fb-5ae522d3b0b8]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6e8d5758-5957-42ee-a09c-85b705220239]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a72e685b-b22a-4e3e-b912-d517a1397a3e]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2a2d6d1b-e906-409b-a1c9-f92865467a7b]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bea357-902a-4419-9436-371f028420cf]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=12ce064d-e521-4626-a4e8-6f95fe6cdd80]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e20f31c0-6a4b-44fd-98c2-d9210456df34]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=27bb0ecd-8865-476d-a5d5-49b318862d17]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_openid_client.this: Refreshing state... [id=934c9beb-0886-4f5d-a0bd-4482c0bdcd9d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3128beca-d686-491b-a8ca-1ad82f7c0680]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=324970c7-bdb6-4f3e-8f8d-797e7d010ac7]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bb3da34d-4714-4ecb-be42-9e396bed8406]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=94d6e111-35e7-4af0-8c2c-5d1edb6bde21]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9233062d-7b5d-4bc8-847d-99dcd6d7dac6]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29935c7c-1439-4665-9d86-02672a8d71ad]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a3fbe3-f8de-4d37-a66c-792e6ee66f87]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4036e5b-1106-4ac4-9830-cba8c1b748a7]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cc148327-319c-475c-a943-8a313bc7f828]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fc927d9-9245-4aa1-98ef-441e07cb05ef]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2fa4c6a4-df79-4d65-990b-6ad664f88e84]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6317c2ef-91bd-46a1-963a-0a7afdeaf7c9]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=602df616-9e86-41a7-8877-fe684ecabff1]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=802f1d36-b108-4397-a8ec-c21e59dd7cae]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4c929283-3ab7-4e43-a7e5-65de6046bf18]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=99202aa7-1878-4183-aa07-d83bed9002ed]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=0c62f2ce-c27e-4173-b692-57789a7a9bc7]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbb8d93f-8bf6-47ba-9280-f2902412d568]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ef30d3ad-5550-4098-9359-9908c0620b62]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3e8f1e74-984b-4267-8b0f-8b22469fd055]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5464af2a-dee3-41a6-816d-021bf5947753]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=934f5472-219a-417d-8ec5-8aa7bf64c206]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47adddae-1f15-494f-a779-2aa73d2fa5e1]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=b99e92e1-b511-48d0-a667-dec8baa567b8]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=417d247a-5183-4a95-ac72-180fa91bde9b]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa54bd66-7db0-4edf-aef5-d59c1be7c01a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5dcccb6-11fc-4959-891f-eb913d465e90]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e556d93f-00bf-43b2-a8ea-4271ceca49ae]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5aa5ebed-497c-42a5-b8be-518ba04f74ca]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=11f414ef-3e8f-4c2b-8379-4bc85f8d2051]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=648884f9-6c6e-4c1f-8c92-156560e7cb49]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0f5563b-6697-4ac8-b35d-fd79b3528e28]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5eeaded1-a96a-4a38-a826-d84f1c5c9210]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b033767f-c3f0-4cc7-8a3a-358d280c4904]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4df5b321-c4b5-4cb5-961b-3b01d71470f1]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=153d5614-3ea8-4313-beb3-0abaa48d82c0]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c6eaa078-6965-4f29-85c4-28a4e7f9ae27]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eab68a5f-0f4e-4654-bcb6-7220ffdd74ee]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6e98bf3-929b-450b-a98f-82cd47b03fba]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=93ce7085-7fbe-4fed-b401-1660f3de7ab3]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=753fae22-08a1-40e1-b798-0594a06fa2ce]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=837635b3-fc3a-4442-9148-451f1b74ca55]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a3e3d19-036a-4abd-9b2c-ee1e5094bb51]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ab394989-a8f2-425c-a1e2-2fac53eccb32]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d7aa8d1-63d1-436b-a556-bfb2702ebbc2]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29f047e8-c730-4351-bfc6-b52f399dd9ea]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=86d6bd6c-b64f-4bc4-ab32-fe4a218edf1f]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3d25a5b8-9836-4b23-9366-2a7905eb826c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "work-bc-teacher-resources"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "work-bc-teacher-resources"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://careereducation.workbc.ca/openid-connect/keycloak",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "work-bc-teacher-resources"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "work-bc-teacher-resources"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://careereducation-test.workbc.ca/openid-connect/keycloak",
        ]
    }

Plan: 8 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 80 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @nvunnamm, Action: `pull_request`*